In [2]:
import pandas as pd
import numpy as np

#### DataFrame.lt(other, axis='columns', level=None)
#### DataFrame.gt(other, axis='columns', level=None)
#### DataFrame.le(other, axis='columns', level=None)
#### DataFrame.ge(other, axis='columns', level=None)
#### DataFrame.ne(other, axis='columns', level=None)
#### DataFrame.eq(other, axis='columns', level=None)

In [30]:
df = pd.DataFrame(
    {'cost': [250, 150, 100],
     'revenue': [100, 250, 300]
    },
    index=['A', 'B', 'C'])
df

   cost  revenue
A   250      100
B   150      250
C   100      300

In [29]:
df == 100

    cost  revenue
A  False     True
B  False    False
C   True    False

In [31]:
df.eq(100)

    cost  revenue
A  False     True
B  False    False
C   True    False

In [32]:
df != pd.Series([100, 250], index=["cost", "revenue"])

#Series
# cost    =100
# revenue =250
# dtype: int64

# if any values in cost    column is 100 then False else True
# if any values in revenue column is 250 then False else True

    cost  revenue
A   True     True
B   True    False
C  False     True

In [33]:
df.ne(pd.Series([100, 300], index=["A", "D"]), axis='index')

# A    100
# D    300
# dtype: int64

   cost  revenue
A  True    False
B  True     True
C  True     True
D  True     True

In [43]:
df == [250, 100]

    cost  revenue
A   True     True
B  False    False
C  False    False

In [41]:
df.eq([250, 250, 100], axis='index')

    cost  revenue
A   True    False
B  False     True
C   True    False

In [44]:
other = pd.DataFrame({'revenue': [300, 250, 100, 150]},
                     index=['A', 'B', 'C', 'D'])
other

   revenue
A      300
B      250
C      100
D      150

In [16]:
df.gt(other)

    cost  revenue
A  False    False
B  False    False
C  False     True
D  False    False

In [45]:
df_multindex = pd.DataFrame(
    {'cost': [250, 150, 100, 150, 300, 220],
      'revenue': [100, 250, 300, 200, 175, 225]},
      index=[
          ['Q1', 'Q1', 'Q1', 'Q2', 'Q2', 'Q2'],
          ['A', 'B', 'C', 'A', 'B', 'C']]
)
df_multindex

      cost  revenue
Q1 A   250      100
   B   150      250
   C   100      300
Q2 A   150      200
   B   300      175
   C   220      225

In [19]:
df.le(df_multindex, level=1)

       cost  revenue
Q1 A   True     True
   B   True     True
   C   True     True
Q2 A  False     True
   B   True    False
   C   True    False